//在本问题中, 树指的是一个连通且无环的无向图。 
//
// 输入一个图，该图由一个有着N个节点 (节点值不重复1, 2, ..., N) 的树及一条附加的边构成。附加的边的两个顶点包含在1到N中间，这条附加的边不属
//于树中已存在的边。 
//
// 结果图是一个以边组成的二维数组。每一个边的元素是一对[u, v] ，满足 u < v，表示连接顶点u 和v的无向图的边。 
//
// 返回一条可以删去的边，使得结果图是一个有着N个节点的树。
// 如果有多个答案，则返回二维数组中最后出现的边。
// 答案边 [u, v] 应满足相同的格式 u < v。
// 
//
// 示例 1： 
//
// 输入: [[1,2], [1,3], [2,3]]
//输出: [2,3]
//解释: 给定的无向图为:
//      1
//     / \
//    2 - 3
// 
//
// 示例 2： 
//
// 输入: [[1,2], [2,3], [3,4], [1,4], [1,5]]
//输出: [1,4]
//解释: 给定的无向图为:
//5 - 1 - 2
//    |   |
//    4 - 3
//
//
// 注意: 
//
// 
// 输入的二维数组大小在 3 到 1000。 
// 二维数组中的整数在1到N之间，其中N是输入数组的大小。 
// 
//
// 更新(2017-09-26): 
// 我们已经重新检查了问题描述及测试用例，明确图是无向 图。对于有向图详见冗余连接II。对于造成任何不便，我们深感歉意。
// Related Topics 树 并查集 图 
// 👍 232 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
class Solution
{
public:

    // 树指的是一个连通且无环的无向图，如果有多个答案，则返回二维数组中最后出现的边
    // 最后构成环的也一定是最后出现的边
    // 思路：
    // 返回最先构成环的 edge
    // 1. 构造并查集
    // 2. 判断edge的两个节点是否都属于一个集合，如果都属于一个集合，那么返回这个edge
    // 这可真是一道良心题目啊，真简单
    vector<int> findRedundantConnection(vector <vector<int>> &edges)
    {
        UnionFind uf(edges.size());
        for (vector<int> edge:edges)
        {
            int x = edge[0] - 1;
            int y = edge[1] - 1;
            if (uf.find(x) == uf.find(y)) return edge;
            uf.unite(x, y);
        }
        return {};
    }


private:

    class UnionFind
    {
    private:
        vector<int> parent;
        vector<int> rank;

    public:

        UnionFind(int N)
        {
            parent = vector<int>(N);
            rank = vector<int>(N);
            for (int i = 0; i < N; ++i)
            {
                parent[i] = i;
                rank[i] = 1;
            }
        }

        int find(int x)
        {
            if (x != parent[x])
            {
                parent[x] = find(parent[x]);
            }
            return parent[x];
        }

        void unite(int x, int y)
        {
            int px = find(x);
            int py = find(y);

            if (px != py)
            {
                if (rank[px] > rank[py])
                {
                    parent[py] = px;
                } else if (rank[px] < rank[py])
                {
                    parent[px] = py;
                } else {
                    parent[px] = py;
                    rank[py]++;
                }
            }
        }

    };
};
//leetcode submit region end(Prohibit modification and deletion)
