// 给定一个二进制矩阵 A，我们想先水平翻转图像，然后反转图像并返回结果。
//
// 水平翻转图片就是将图片的每一行都进行翻转，即逆序。例如，水平翻转 [1, 1, 0] 的结果是 [0, 1, 1]。 
//
// 反转图片的意思是图片中的 0 全部被 1 替换， 1 全部被 0 替换。例如，反转 [0, 1, 1] 的结果是 [1, 0, 0]。 
//
// 示例 1: 
//
// 
//输入: [[1,1,0],
//      [1,0,1],
//      [0,0,0]]
//
//输出: [[1,0,0],
//      [0,1,0],
//      [1,1,1]]
//解释: 首先翻转每一行: [[0,1,1],[1,0,1],[0,0,0]]；
//     然后反转图片: [[1,0,0],[0,1,0],[1,1,1]]
// 
//
// 示例 2: 
//
// 
//输入: [[1,1,0,0],[1,0,0,1],[0,1,1,1],[1,0,1,0]]
//输出: [[1,1,0,0],[0,1,1,0],[0,0,0,1],[1,0,1,0]]
//解释: 首先翻转每一行: [[0,0,1,1],[1,0,0,1],[1,1,1,0],[0,1,0,1]]；
//     然后反转图片: [[1,1,0,0],[0,1,1,0],[0,0,0,1],[1,0,1,0]]
// 
//
// 说明: 
//
// 
// 1 <= A.length = A[0].length <= 20 
// 0 <= A[i][j] <= 1 
// 
// Related Topics 数组 
// 👍 197 👎 0


//leetcode submit region begin(Prohibit modification and deletion)
class Solution
{
public:

    // 一刷，2020.12.25
    // 这种题真是太简单了，但是也有技巧，可以将reverse 和 值替换放在一起，注意列数为奇数的情况
    vector <vector<int>> flipAndInvertImage(vector <vector<int>> &A)
    {
        int l, r;
        for (int i = 0; i < A.size(); ++i)
        {
            l = 0, r = A[i].size() - 1;
            while (l < r)
            {
                A[i][l] = A[i][l] == 0 ? 1 : 0;
                A[i][r] = A[i][r] == 0 ? 1 : 0;
                swap(A[i][l++], A[i][r--]);
            }
            if (A[i].size() % 2 != 0)
            {
                int mid = A.size() / 2;
                A[i][mid] = A[i][mid] == 0 ? 1 : 0;
            }
        }
        return A;
    }
};
//leetcode submit region end(Prohibit modification and deletion)
